config.org
#+title: Doom Emacs Config
#+author: Mia Kuon
#+description: My personal literate Doom Emacs Config

* About this config
Unlike regular config this one is literate. It means all =src block= are tangled into ~config.el~ on save and on ~doom sync~, unless ~:tangle no~. More about that [[file:~/.config/emacs/modules/config/literate/README.org][here]].

Some parts taken from [[https://gitlab.com/dwt1/dotfiles/-/blob/master/.config/doom/config.org][DT's config]]

** Header
#+begin_src emacs-lisp :tangle yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;;; Commetary: My Doom Emacs Config
#+end_src
* ID
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets.
#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Mia Kuon"
      user-mail-address "mia.kuon@gmail.com"
      doom-user-dir "/home/mia/.dotfiles/.config/doom")
      #+end_src
* UI
** TODO Themes
/Setting the theme to doom-one.  To try out new themes, I set a keybinding for counsel-load-theme with 'SPC h t'./

*Code*:
- doom-horizon - фиолетовая с красными оттенками
- doom-shades-of-purple  - очень фиолетовая)
- doom-laserwave - фиолетовая с голубыми оттенками
- doom-ir-black - совсем чёрная, контрастная

*Чтение*:
*Редактирование текста*: doom-monokai-spectrum
- doom-dark+

*Просмотр заметок*: doom-monokai-ristretto
- doom-rouge
- doom-dracula
- doom-gruvbox
- doom-latern

*Org*: doom-badger
*Latex*-editor-mode: doom-meltbus
*Для всего остального*: doom-one

#+begin_src emacs-lisp :tangle yes
(add-to-list 'initial-frame-alist '(fullscreen . fullboth))
(add-to-list 'default-frame-alist '(fullscreen . fullboth))
(setq doom-theme 'doom-one)

(setq display-line-numbers-type t)
(show-paren-mode 1)
#+end_src
** TODO FONTS
Settings related to fonts within Doom Emacs:
+ 'doom-font' -- standard monospace font that is used for most things in Emacs.
+ 'doom-variable-pitch-font' -- variable font which is useful in some Emacs plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.
+ 'font-lock-comment-face' -- for comments.
+ 'font-lock-keyword-face' -- for keywords with special significance like 'setq' in elisp.
** MODELINE
The modeline is the bottom status bar that appears in Emacs windows.  For more information on what is available to configure in the Doom modeline, check out:
https://github.com/seagle0128/doom-modeline
** Scrolling
#+begin_src emacs-lisp :tangle yes
(after! doom-ui
  (pixel-scroll-precision-mode 1)
  (setq scroll-step 1
        scroll-conservatively 101
        auto-window-vscroll nil)

  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
  (setq mouse-wheel-progressive-speed nil))

#+end_src

#+RESULTS:

** Start Page
The dashboard that appears when Doom Emacs starts

#+begin_src emacs-lisp :tangle yes
(defun my-doom-dashboard-banner ()
  "Custom dashboard banner."
  (let* ((banner
          '("I had once screamed."
            "              Gradually, I lost my voice."
            "I had once cried."
            "              Gradually, I lost my tears."
            "I had once grieved."
            "              Gradually, I became able to withstand everything."
            "I had once rejoiced."
            "              Gradually, I became unmoved by the world."
            "And now!"
            " "
            "All I have left is an expressionless face,"
            "              My gaze is as tough as a monolith,"
            "Only perseverance remains in my heart."
            " "
            "This is my own insignificant person, Kuon Mia's – Perseverance!"
            " "
            " "))
         (width (window-width))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat
                 line (make-string (max 0 (- longest-line (length line)))
                                   32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-menu-sections
      '(("Recently opened files" :icon
         (nerd-icons-faicon "nf-fa-file_text" :face 'doom-dashboard-menu-title)
         :action recentf-open-files)
        ("Reload last session" :icon
         (nerd-icons-octicon "nf-oct-history" :face 'doom-dashboard-menu-title)
         :when
         (cond
          ((modulep! :ui workspaces)
           (file-exists-p
            (expand-file-name persp-auto-save-fname persp-save-dir)))
          ((require 'desktop nil t)
           (file-exists-p
            (desktop-full-file-name))))
         :action doom/quickload-session)
        ("Open org-agenda" :icon
         (nerd-icons-octicon "nf-oct-calendar" :face 'doom-dashboard-menu-title)
         :when
         (fboundp 'org-agenda)
         :action org-agenda)
        ("Open project" :icon
         (nerd-icons-octicon "nf-oct-briefcase" :face 'doom-dashboard-menu-title)
         :action projectile-switch-project)
        ("Jump to bookmark" :icon
         (nerd-icons-octicon "nf-oct-bookmark" :face 'doom-dashboard-menu-title)
         :action bookmark-jump)
        ("Open private configuration" :icon
         (nerd-icons-octicon "nf-oct-tools" :face 'doom-dashboard-menu-title)
         :when
         (file-directory-p doom-user-dir)
         :action doom/open-private-config)
        ("Open documentation" :icon
         (nerd-icons-octicon "nf-oct-book" :face 'doom-dashboard-menu-title)
         :action doom/help))
      +doom-dashboard-ascii-banner-fn #'my-doom-dashboard-banner
      +doom-dashboard-inhibit-refresh t
      +doom-dashboard-functions '(doom-dashboard-widget-banner
                                  doom-dashboard-widget-shortmenu
                                  doom-dashboard-widget-loaded
                                  nil))
#+end_src
* Encoding
#+begin_src emacs-lisp :tangle yes
(set-language-environment "Russian")
(prefer-coding-system 'utf-8)

; find output encoding
(setq find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld"))
#+end_src
* TODO Org
