config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
;;; Commetary: My Doom Emacs Config

(setq user-full-name "Mia Kuon"
      user-mail-address "mia.kuon@gmail.com"
      doom-user-dir "/home/mia/.dotfiles/.config/doom")

(add-to-list 'initial-frame-alist '(fullscreen . fullboth))
(add-to-list 'default-frame-alist '(fullscreen . fullboth))
(setq doom-theme 'doom-one)

(setq display-line-numbers-type t)
(show-paren-mode 1)

(after! doom-ui
  (pixel-scroll-precision-mode 1)
  (setq scroll-step 1
        scroll-conservatively 101
        auto-window-vscroll nil)

  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
  (setq mouse-wheel-progressive-speed nil))

(defun my-doom-dashboard-banner ()
  "Custom dashboard banner."
  (let* ((banner
          '("I had once screamed."
            "              Gradually, I lost my voice."
            "I had once cried."
            "              Gradually, I lost my tears."
            "I had once grieved."
            "              Gradually, I became able to withstand everything."
            "I had once rejoiced."
            "              Gradually, I became unmoved by the world."
            "And now!"
            " "
            "All I have left is an expressionless face,"
            "              My gaze is as tough as a monolith,"
            "Only perseverance remains in my heart."
            " "
            "This is my own insignificant person, Kuon Mia's – Perseverance!"
            " "
            " "))
         (width (window-width))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat
                 line (make-string (max 0 (- longest-line (length line)))
                                   32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-menu-sections
      '(("Recently opened files" :icon
         (nerd-icons-faicon "nf-fa-file_text" :face 'doom-dashboard-menu-title)
         :action recentf-open-files)
        ("Reload last session" :icon
         (nerd-icons-octicon "nf-oct-history" :face 'doom-dashboard-menu-title)
         :when
         (cond
          ((modulep! :ui workspaces)
           (file-exists-p
            (expand-file-name persp-auto-save-fname persp-save-dir)))
          ((require 'desktop nil t)
           (file-exists-p
            (desktop-full-file-name))))
         :action doom/quickload-session)
        ("Open org-agenda" :icon
         (nerd-icons-octicon "nf-oct-calendar" :face 'doom-dashboard-menu-title)
         :when
         (fboundp 'org-agenda)
         :action org-agenda)
        ("Open project" :icon
         (nerd-icons-octicon "nf-oct-briefcase" :face 'doom-dashboard-menu-title)
         :action projectile-switch-project)
        ("Jump to bookmark" :icon
         (nerd-icons-octicon "nf-oct-bookmark" :face 'doom-dashboard-menu-title)
         :action bookmark-jump)
        ("Open private configuration" :icon
         (nerd-icons-octicon "nf-oct-tools" :face 'doom-dashboard-menu-title)
         :when
         (file-directory-p doom-user-dir)
         :action doom/open-private-config)
        ("Open documentation" :icon
         (nerd-icons-octicon "nf-oct-book" :face 'doom-dashboard-menu-title)
         :action doom/help))
      +doom-dashboard-ascii-banner-fn #'my-doom-dashboard-banner
      +doom-dashboard-inhibit-refresh t
      +doom-dashboard-functions '(doom-dashboard-widget-banner
                                  doom-dashboard-widget-shortmenu
                                  doom-dashboard-widget-loaded
                                  nil))

(set-language-environment "Russian")
(prefer-coding-system 'utf-8)

; find output encoding
(setq find-ls-option '("-print0 | xargs -0 ls -ld" . "-ld"))

;(map! :leader
