config.org
** Org-mode
I wrapped most of this block in (after! org).  Without this, my settings might be evaluated too early, which will result in my settings being overwritten by Doom's defaults.  I have also enabled org-journal, org-superstar and org-roam by adding (+journal +pretty +roam2) to the org section of my Doom Emacs init.el.

#+begin_src emacs-lisp :tangle yes
                                        ;(map! :leader
                                        ;      :desc "Org babel tangle" "m B" #'org-babel-tangle)
(after! org
  (setq org-directory "~/Гримуар/"
        org-default-notes-file (expand-file-name "Организация/Входящее.org" org-directory)
        org-id-locations-file (expand-file-name ".orgids" org-directory)
        ;; org-ellipsis " ▼ " ; changes outline, default is "[...]"
        ;; org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
        ;; org-superstar-itembullet-alist '((?+ . ?➤) (?- . ?✦)) ; changes +/- symbols in item lists
        org-log-done 'time
        org-hide-emphasis-markers t
        ;; ex. of org-link-abbrev-alist in action
        ;; [[arch-wiki:Name_of_Page][Description]]
        org-link-abbrev-alist    ; This overwrites the default Doom org-link-abbrev-list
        '(("google" . "http://www.google.com/search?q=")
          ("archwiki" . "https://wiki.archlinux.org/index.php/")
          ("doomdir" . "/home/mia/.dotfiles/.config/doom/%s")
          ("emacsdir" . "/home/mia/.config/emacs/%s")
          ("doom-repo" . "https://github.com/doomemacs/doomemacs/%s")
          ("wolfram" . "https://wolframalpha.com/input/?i=%s")
          ("wikipedia" . "https://en.wikipedia.org/wiki/%s")
          ("duckduckgo" . "https://duckduckgo.com/?q=%s")
          ("gmap" . "https://maps.google.com/maps?q=%s")
          ("gimages" . "https://google.com/images?q=%s")
          ("youtube" . "https://youtube.com/watch?v=%s")
          ("github" . "https://github.com/%s"))
        ;; org-table-convert-region-max-lines 20000
        org-todo-keywords      ; This overwrites the default Doom org-todo-keywords
        '((sequence            ;; Tasks
           "STRT(s)"           ; Task is started
           "TODO(t)"           ; A task that is ready to be tackled
           "WAIT(w)"           ; Something is holding up this task
           "IDEA(i)"           ; An idea that needs to be moved or to be done
           "PROJ(p)"           ; A project that contains other tasks
           "HBBT(h)"           ; A habbit
           "|"                 ; The pipe necessary to separate "active" states and "inactive" states
           "DONE(d)"           ; Task has been completed
           "CANCELLED(c)"      ; Task has been cancelled
           "FAIL(f)")          ; Task has been failed
          (sequence            ;; Calendar
           "INVITE(I)"         ; Just an event that I'm envited to
           "EVENT(E)"          ; An event that I'm going to
           "|"
           "VISITED(V)"
           "CANCELLED(C)"
           "MISSED(M)"
           "CLOSED(L)")
          (sequence             ; States
           "[ ](T)"
           "[-](S)"
           "[?](W)"
           "|"
           "[X](D)")
          (sequence             ; Notes states
           "Написать(y)"
           "Дописать(l)"
           "Переписать(g)"
           "Переместить(G)"
           "|")))

  (map! :leader
        (:prefix "m"
         :desc "Cycle list bullets"     [TAB]  #'org-cycle-list-bullet)))
#+end_src

