config.org
** TODO Org-agenda
#+begin_src emacs-lisp :tangle yes
(after! org
  ;; (defvar org-agenda-subdirectory "Организация" "Directory in org-directory that contains all organization realted files")
  ;; (defvar org-agenda-directory (expand-file-name "Организация/" org-directory) "Directory with Org Agenda files")
  ;; (setq org-agenda-files (directory-files-recursively org-agenda-directory "\.org$"))
  (setq org-agenda-files
        (append
         (directory-files-recursively "~/Гримуар/Организация/Проекты" "\\.org$")
         (directory-files-recursively "~/Гримуар/Организация/Ценности" "\\.org$")
         '("~/Гримуар/Организация"
           "~/Гримуар/Организация/Планы"
           "~/Гримуар/Контакты"
           "~/Гримуар/Заметки"
           "~/Гримуар/Дневник")))
  (setq org-agenda-file-regexp "\\.org\\'")
  (setq org-agenda-start-day "-1d"))

;; (setq
   ;; org-priority-faces
   ;; '((?A :foreground "#ff6c6b" :weight bold)
   ;;   (?B :foreground "#98be65" :weight bold)
   ;;   (?C :foreground "#c678dd" :weight bold))
   ;; org-agenda-block-separator 8411)

(use-package! org-super-agenda
  :after org-agenda
  :config
  (org-super-agenda-mode))

(setq org-agenda-custom-commands
      '(("v" "A better agenda view"
         ((tags "PRIORITY=\"A\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "High-priority unfinished tasks:")))
          (tags "PRIORITY=\"B\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Medium-priority unfinished tasks:")))
          (tags "PRIORITY=\"C\""
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header "Low-priority unfinished tasks:")))))
        ("p" "Задачи по проектам"
         ((alltodo ""
                   ((org-super-agenda-groups
                     '((:auto-group t)
                       (:discard (:not (:tag t)))))))))
        ("D" "Задачи по дедлайнам"
         ((alltodo ""
           ((org-super-agenda-groups
             '((:name "🔴 Просроченные"
                :and (:deadline past :todo t))
               (:name "🟡 С дедлайном"
                :and (:deadline future :todo t))
               (:name "⚪ Без дедлайна"
                :and (:not (:deadline)) :todo t)))))))
        ("r" "Дедлайны"
         ((alltodo ""
                  ((org-super-agenda-groups
                    '((:name "🔴 Просроченные"
                       :and (:deadline past :todo t))
                      (:name "🟡 С дедлайном"
                       :and (:deadline future :todo t))
                      (:name "⚪ Без дедлайна"
                       :and (:not (:deadline)) :todo t)))
                   (org-agenda-prefix-format '((todo . " %i %-12:c[%-5e]%?-12t% s")))))))
        ("g" "Get Things Done"
         ((agenda ""
                  ((org-agenda-skip-function
                    '(org-agenda-skip-entry-if 'deadline))
                   (org-deadline-warning-days 0)))
          (todo "NEXT"
                ((org-agenda-skip-function
                  '(org-agenda-skip-entry-if 'deadline))
                 (org-agenda-prefix-format "  %i %-12:c [%e] ")
                 (org-agenda-overriding-header "\nTasks\n")))
          (agenda nil
                  ((org-agenda-entry-types '(:deadline))
                   (org-agenda-format-date "")
                   (org-deadline-warning-days 7)
                   (org-agenda-skip-function
                    '(org-agenda-skip-entry-if 'notregexp "\\* NEXT"))
                   (org-agenda-overriding-header "\nDeadlines")))
          (tags-todo "inbox"
                     ((org-agenda-prefix-format "  %?-12t% s")
                      (org-agenda-overriding-header "\nInbox\n")))
          (tags "CLOSED>=\"<today>\""
                ((org-agenda-overriding-header "\nCompleted today\n")))))
        ("u" "Unscheduled TODOs by Category"
         ((alltodo ""
                   ((org-agenda-overriding-header "Нераспределённые задачи по категориям")
                    (org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'scheduled 'deadline))
                    (org-super-agenda-groups
                     '((:auto-category t)))))))
        ("d" "Daily View"
         ((agenda ""                             ; Агенда на сегодня
                  ((org-agenda-span 'day)
                   (org-agenda-start-day nil)
                   (org-agenda-overriding-header "Сегодня")))
          (tags "*"                            ; Все задачи из Входящее.org
                   ((org-agenda-files '("~/Гримуар/Организация/Входящее.org"))
                    (org-agenda-overriding-header "Входящие")))
          (search "CLOSED>=\"<today>\""          ; Сделано сегодня
                  ((org-agenda-overriding-header "\nСделано сегодня\n")))))))
#+end_src
** GTD
