config.el

;;; ─── Вспомогательные функции для capture ─────────────────────────────────────────────
(defun my/org-capture-area-file ()
  "Prompt for an area-file"
  (read-file-name "Ценность: "
                  "~/Гримуар/Организация/Ценности/"
                  nil t nil
                  (lambda (f)
                    (and (file-regular-p f)
                         (string-match "ценность-.*\\.org\\'" f)))))

(defun my/org-capture-project-or-area-file ()
  "Prompt for an area- or proj-file"
  (completing-read
   "Выберите файл: "
   (append
    (file-expand-wildcards (concat org-directory "Организация/Ценности/*/ценность-*.org"))
    (file-expand-wildcards (concat org-directory "Организация/Проекты/*/проект-*.org")))))

;;; ─── Шаблоны capture ──────────────────────────────────────────────────────────────────
(after! org
  (setq org-capture-templates
        ;; ── GTD ──────────────────────────────────────────────────────────
        `(("g" "GTD")
          ("gi" "Inbox" entry  (file "Организация/Входящее.org")
         "* TODO %?\n:PROPERTIES:\n:ID: %(org-id-new)\n:NOTETYPE: задача\n:ENTERED_ON: %U\n:END:"
         :prepend t :empty-lines-before 1)
          ("gm" "Meeting" entry  (file+headline "Организация/Расписание.org" "Личное")
           "* EVENT %? %^G\nSCHEDULED: %^T\n:PROPERTIES:\n:ID: %(org-id-new)\n:NOTETYPE: событие\n:ENTERED_ON: %U\n:END:\n_Участники_: \n_Место_: "
           :prepend t)
          ("gc" "Current" entry (file "Организация/Текущее.org")
           "* TODO %?\nSCHEDULED: %t\n:PROPERTIES:\n:ID: %(org-id-new)\n:NOTETYPE: задача\n:ENTERED_ON: %U\n:END:"
           :prepend t :empty-lines-before 1)
          ("gh" "Habbit" entry (file+headline my/org-capture-area-file "Привычки")
           "* HBBT %?\nSCHEDULED: <%<%Y-%m-%d %a %H:00> +1d>\n:PROPERTIES:\n:ID: %(org-id-new)\n:NOTETYPE: привычка\n:STYLE:           Habbit\n:REPEAT_TO_STATE: HBBT\n:END:\n:PROPERTIES:\n:EFFORT: %^{EFFORT}p\n:ENTERED_ON: %U\n:END:"
           :prepend t)
          ("gt" "TODO" entry (file+headline my/org-capture-project-or-area-file "Задачи")
           "* TODO %^{Задача}%? %^{Обстоятельства|@computer|@telephone|@home|@work|@university|@transfer|@locality|@meeting|@myself}g%^G\nDEADLINE: %^{Deadline}t SCHEDULED: %^{Scheduled}T\n:PROPERTIES:\n:ID: %(org-id-new)\n:NOTETYPE: задача\n:EFFORT: %^{EFFORT}p\n:ENTERED_ON: %U\n:END:"
           :prepend t)
          ("gw" "Work" entry (file+headline "Организация/Проекты/АКАДО/проект-акадо.org" "Задачи")
           "* TODO %^{Задача}%? %^G\nDEADLINE: %^{Deadline}t SCHEDULED: %^{Scheduled}T\n:PROPERTIES:\n:EFFORT: %^{EFFORT}p\n:ENTERED_ON: %U\n:END:"
           :prepend t)

          ;; ── Notes ────────────────────────────────────────────────────────
          ("n" "Teplates for notes")
          ("nn" "Link current note" item (file+headline my/org-capture-project-or-area-file "Заметки")
           "- %A%?"
           :prepend nil :unnarrowed t)
          ("np" "Link current project" item (file+headline my/org-capture-project-or-area-file "Проекты")
           "- %A%?"
           :prepend nil :unnarrowed t)
          ("na" "Link current area" item (file+headline my/org-capture-area-file "Ценности")
           "- %A%?"
           :prepend nil :unnarrowed t)

          ;; ── Journal ──────────────────────────────────────────────────────
          ;; ("j" "Journal")
          ;; ("jd" "Daily" entry
          ;;  (file+olp+datetree +org-capture-journal-file)
          ;;  "* %U %?\n%i\n%a" :prepend t)
          ;; ("jw" "Weekly" entry)
          ;; ("jm" "Monthly" entry)
          ;; ("jy" "Yearly" entry)

          ;; ── Projects ─────────────────────────────────────────────────────
          ("p" "Templates for projects") ;; TODO написать рабочие функции
          ("pt" "Project-local todo" entry
           (file+headline +org-capture-project-todo-file "Inbox")
           "* TODO %?\n%i\n%a" :prepend t)
          ("pn" "Project-local notes" entry
           (file+headline +org-capture-project-notes-file "Inbox")
           "* %U %?\n%i\n%a" :prepend t)
          ("pc" "Project-local changelog" entry
           (file+headline +org-capture-project-changelog-file "Unreleased")
           "* %U %?\n%i\n%a" :prepend t)
;;           ("pj" "Job Application" entry (file "Организация/Проекты/Трудоустройство/список-отклики_на_вакансии.org")
;;            "* TODO %? в %^{Компания}
;; DEADLINE: %^{Дедлайн вакансии}t SCHEDULED: %^{Проверить статус}t
;; :PROPERTIES:
;; :DATE_APPLIED: %t
;; :POSITION: %^{Позиция}
;; :SOURCE: %^{Источник вакансии|hh.ru|LinkedIn|website|Telegram}
;; :CONTACT: %^{Контакт}
;; :STATUS: %^{Статус|В ожидании отклика|Жду ответа|Отказ}
;; :LOCATION: %^{Локация|Москва|Удалённо}
;; :END:
;; - [ ] " :prepend t :empty-lines-before 1)
          ("o" "Centralized templates for projects")
          ("ot" "Project todo" entry
           #'+org-capture-central-project-todo-file "* TODO %?\n %i\n %a" :heading "Tasks" :prepend nil)
          ("on" "Project notes" entry
           #'+org-capture-central-project-notes-file "* %U %?\n %i\n %a" :heading "Notes" :prepend t)
          ("oc" "Project changelog" entry
           #'+org-capture-central-project-changelog-file "* %U %?\n %i\n %a" :heading "Changelog" :prepend t))))

(after! org
  (setq org-log-into-drawer t)
  (setq org-log-reschedule 'time))
