config.el

(setq org-journal-dir "~/Гримуар/Дневник/"
      org-journal-date-prefix "* "
      org-journal-time-prefix "** "
      org-journal-date-format "%B %d, %Y (%A) "
      org-journal-file-format "%Y-%m-%d.org")

(after! org
  (setq org-download-image-dir "attachments"
        org-download-method 'directory
        org-download-heading-lvl nil))

(defun my/org-attach-id-flat (id)
  "Return flat path for attachment with ID."
  "")

(after! org
  (setq org-attach-method 'directory             ;; Храним в общей директории
        org-attach-preferred-new-method 'ask     ;; Как сохранять когда нет ID и DIR
        org-attach-directory "attachments"       ;; Папка рядом с org-файлом
        org-attach-id-dir "attachments"
        org-attach-use-inheritance nil           ;; Не искать директории выше
        org-attach-auto-tag nil                  ;; Не добавлять тег :ATTACH:
        org-attach-store-link-p 'attached        ;; Всегда вставлять ссылку на файл
        org-attach-id-to-path-function-list
        '(my/org-attach-id-flat)))

(after! org
