config.org
** Org-roam
[[https://github.com/org-roam/org-roam][Org-roam]] is a plain-text knowledge management system.  Org-roam borrows principles from the =Zettelkasten= method, providing a solution for non-hierarchical note-taking.  It should also work as a plug-and-play solution for anyone already using Org-mode for their personal wiki.

| COMMAND                | DESCRIPTION                          | KEYBINDING |
|------------------------+--------------------------------------+------------|
| completion-at-point    | /Completion of node-insert at point/ | SPC n r c  |
| org-roam-node-find     | /Find node or create a new one/      | SPC n r f  |
| org-roam-graph         | /Show graph of all nodes/            | SPC n r g  |
| org-roam-node-insert   | /Insert link to a node/              | SPC n r i  |
| org-roam-capture       | /Capture to node/                    | SPC n r n  |
| org-roam-buffer-toggle | /Toggle roam buffer/                 | SPC n r r  |

*** Variables
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-roam-directory org-directory
        org-roam-graph-viewer "/usr/bin/firefox"  ; TODO поменять на qutebrowser
        +org-roam-auto-backlinks-buffer t))

(use-package! websocket
  :after org-roam)

(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))

;; (map! :leader
;;       (:prefix ("n r" . "org-roam")
;;        :desc "Completion at point" "c" #'completion-at-point
;;        :desc "Find node"           "f" #'org-roam-node-find
;;        :desc "Show graph"          "g" #'org-roam-ui-open
;;        :desc "Show local graph"    "G" #'org-roam-ui-node-local
;;        :desc "Insert node"         "i" #'org-roam-node-insert
;;        :desc "Capture to node"     "n" #'org-roam-capture
;;        :desc "Toggle roam buffer"  "r" #'org-roam-buffer-toggle))
#+end_src
*** Org-roam-capture
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-roam-capture-templates
        `(("c" "Записка, Черновик" plain "%?\n* Ссылки"
           :target (file+head
                    "Заметки/Входящие/%<%Y%m%d%H%M%S>.org"
                    ":PROPERTIES:
:CDATE:     %U
:END:
,#+title: ${title}
,#+date: %U
,#+notetype: %^{Тип заметки|записка|черновик}
,#+filetags: %^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("f" "Фундаментальная, Мысль, Цитата" plain "%?\n* Ссылки\n** Связи\n** Источники"
           :target (file+head
                    "Заметки/%<%Y%m%d%H%M%S>-${slug}.org"
                    ":PROPERTIES:
:CDATE:     %U
:ACCESS:   %^{Доступ|public|private|personal|confidentional}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: %^{Язык|русский|english|français|中文}
,#+notetype: %^{Тип заметки|фундаментальная|мысль|цитата}
,#+filetags: %^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("n" "Заметка, Статья, Руководство" plain "* ${title}\n%?\n* Ссылки"
           :target (file+head
                    "Заметки/%<%Y%m%d%H%M%S>-${slug}.org"
                    ":PROPERTIES:
:CDATE:     %U
:ACCESS:   %^{Доступ|public|private|personal|confidentional}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: русский
,#+notetype: %^{Тип заметки|заметка|статья|руководство}
,#+filetags: %^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("a" "Конспект" plain "* ${title}\n%?\n* Источник\n%A\n* Ссылки\n* TODO Добавить синонимы, если нужно"
           :target (file+head
                    "Заметки/конспект-${slug}.org"
                    ":PROPERTIES:
:CDATE:     %U
:ACCESS:   %^{Доступ|public|private|personal|confidentional}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: %^{Язык|русский|english|français|中文}
,#+notetype: коспект
,#+sourcetype: %^{Тип источника|статья|видео|аудио|занятие}
,#+filetags: %^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("r" "Рецепт" plain
           "* ${title}\n** Ингредиенты\n- %?\n\n** Приготовление\n1. \n\n** Примечания\n\n* Ссылки"
           :target (file+head
                    "Организация/Ценности/Питание/Рецепты/рецепт-${slug}.org"
                    ":PROPERTIES:
:CDATE:     %U
:ACCESS:    %^{Доступ|public|private|personal|confidential}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: русский
,#+notetype: рецепт
,#+filetags: :рецепт:питание:%^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("x" "Копия" plain "* Источник\n%A\n* ${title}\n%?"
           :target (file+head
                    "Заметки/%<%Y%m%d%H%M%S>-${slug}.org"
                    ":PROPERTIES:
:CDATE:     %U
:ACCESS:   %^{Доступ|public|private|personal|confidentional}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: %^{Язык|русский|english|français|中文}
,#+notetype: копия
,#+sourcetype: %^{Тип источника|статья|видео|аудио|занятие}
,#+filetags: %^G"))
          ("o" "Организация")
          ("oa" "Ценность" plain
           "* Цели
%?
,* Ценности
,* Проекты
,* Привычки
:PROPERTIES:
:CATEGORY: Привычка
:VISIBILITY: content
:END:
,* Заметки
,* Задачи
:PROPERTIES:
:VISIBILITY: content
:END:"

           :target (file+head
                    "Организация/Ценности/ценность-${slug}.org"
                    ":PROPERTIES:
:CDATE:         %U
:ACCESS:       %^{Доступ|public|private|personal|confidentional}
:CATEGORY:     %^{Category для Agenda}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: русский
,#+notetype: организация
,#+filetags: :${slug}:%^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("op" "Проект" plain
           "* Цели
%?
,* Заметки
,* Проекты
,* Задачи
:PROPERTIES:
:VISIBILITY: content
:END:"
           :target (file+head
                    "Организация/Проекты/${title}/проект-${slug}.org"
                    ":PROPERTIES:
:CDATE:         %U
:ACCESS:       %^{Доступ|public|private|personal|confidentional}
:CATEGORY:     %^{Category для Agenda}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: русский
,#+notetype: организация
,#+filetags: :${slug}:%^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("or" "План" plain "* Цели\n%?\n* План\n* Заметки\n* Проекты"
           :target (file+head
                    "Организация/Планирование/план-${slug}.org"
                    ":PROPERTIES:
:CDATE:         %U
:ACCESS:       %^{Доступ|public|private|personal|confidentional}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: русский
,#+notetype: организация
,#+filetags: :${slug}:%^G")
           :unnarrowed t
           :empty-lines-before 1)
          ("p" "Person" plain "%?"
           :target (file+head
                    "Люди/person-${slug}.org"
                    ":PROPERTIES:
:CDATE:         %U
:ACCESS:       %^{Доступ|public|private|personal|confidentional}
:ROAM_ALIASES: %^{Синонимы (в кавычках)}
:END:
,#+title: ${title}
,#+author: %n
,#+date: %U
,#+language: русский
,#+notetype: человек
,#+filetags:

,* ${title}
:PROPERTIES:
:ALIAS: %\\2
:EMAIL: %^{Email}
:PHONE: %^{Phone|+7}
:BIRTHDAY: %^{Birtday}
:ADDRESS:
:NICKNAME:
:END:
,** Заметки
,** Проекты
,** Задачи
:PROPERTIES:
:VISIBILITY: content
:END:")
           :unnarrowed t))))
#+end_src
