config.org
**** TODO Org-roam-capture-templates tangle
#+begin_src emacs-lisp :tangle yes
(defun extract-org-roam-templates ()
  "Extract org-roam-capture-templates from config.org and save to org-roam-templates.el"
  (let ((config-file (expand-file-name "config.org" doom-user-dir))
        (output-file (expand-file-name "org-roam-templates.el" doom-user-dir))
        (template-section nil))
    ;; (message "Читаем файл: %s" config-file)
    (with-temp-buffer
      ;; Читаем config.org
      (insert-file-contents config-file)
      (goto-char (point-min))
      ;; (message "Файл загружен, ищем шаблоны...")

      ;; Ищем начало секции с шаблонами
      (when (re-search-forward "(setq org-roam-capture-templates" nil t)
        ;; (message "Найдено в строке: %d" (line-number-at-pos))
        (beginning-of-line)
        (setq template-section (buffer-substring (point) (progn (forward-sexp) (point)))))

      ;; Если нашли, записываем в отдельный файл
      ;; (when template-section
      ;; (message "Шаблоны извлечены, записываем в %s" output-file)
      (with-temp-file output-file
        ;; (insert ";; Automatically extracted org-roam-capture-templates\n")
        (insert template-section)
        (insert "\n")))))

;; Автоматически запускать после сохранения config.org
(defun auto-extract-org-roam-templates ()
  "Run extract-org-roam-templates when saving config.org."
  (when (string-equal (buffer-file-name)
                      (expand-file-name "config.org" doom-user-dir))
    (message "Extracting org-roam-templates")
    (extract-org-roam-templates)))

(add-hook 'after-save-hook #'auto-extract-org-roam-templates)

#+end_src

Test
#+begin_src emacs-lisp :tangle no
(message "Current after-save-hook: %s" after-save-hook)
#+end_src
*** Slug
Default slug but keeps glyphs

#+begin_src emacs-lisp :tangle yes
(after! org
  (cl-defmethod org-roam-node-slug ((node org-roam-node))
    "My custom slug of NODE."
    (let ((title (org-roam-node-title node)))
      (cl-flet* ((cl-replace (title pair) (replace-regexp-in-string (car pair) (cdr pair) title)))
        (let* ((pairs `(("[^[:word:][:digit:]]" . "_")  ;; convert anything not word chars, digits, or hyphens
                        ("__*" . "_")                    ;; remove sequential underscores
                        ("^_" . "")                      ;; remove starting underscore
                        ("_$" . "")))                    ;; remove ending underscore
               (slug (-reduce-from #'cl-replace title pairs)))
          (downcase slug))))))
#+end_src
** Brain
