config.org
*** PROJ Ontology
Link types

#+begin_src emacs-lisp :tangle yes
;; Переменные конфигурации
(defvar ontology-file (expand-file-name "ontology.org" (getenv "DOOMDIR"))
  "Путь к файлу онтологий")

(defvar ontology-pattern "\\(_[^_]+_\\):\\s-*\\[\\[\\([^]]+\\)\\]\\[\\([^]]+\\)\\]\\]"
  "Регулярное выражение для поиска конструкций онтологии")

(defun ontology-extract-and-save ()
  "Извлекает онтологию из конструкции под курсором и сохраняет в ontology.org"
  (interactive)
  (let ((ontology-name (ontology-get-at-point)))

    (unless ontology-name
      (error "Курсор не находится на конструкции онтологии"))

    ;; Проверяем, существует ли уже такая онтология
    (let ((existing-category (ontology-get-category ontology-name)))
      (if existing-category
          (message "Онтология '%s' уже существует в категории '%s'" ontology-name existing-category)

        ;; Предлагаем выбрать категорию
        (let ((category (completing-read
                         (format "Выберите категорию для '%s': " ontology-name)
                         '("Parent" "Child" "Friend" "None" "Unassigned")
                         nil t)))

          ;; Добавляем онтологию в файл
          (ontology-add-to-file ontology-name category)
          (message "Онтология '%s' добавлена в категорию '%s'" ontology-name category))))))

(defun ontology-get-category (ontology-name)
  "Возвращает категорию онтологии или nil, если онтология не найдена"
  (when (file-exists-p ontology-file)
    (with-temp-buffer
      (insert-file-contents ontology-file)
      (goto-char (point-min))
      (let ((current-category nil)
            (found nil))
        (while (and (not (eobp)) (not found))
          (let ((line (string-trim (thing-at-point 'line t))))
            (cond
             ;; Заголовок категории
             ((string-match "^\\* \\(.+\\)$" line)
              (setq current-category (match-string 1 line)))
             ;; Элемент списка
             ((string-match "^-\\s-*\\(.+\\)$" line)
              (when (string= (match-string 1 line) ontology-name)
                (setq found current-category)))))
          (forward-line 1))
        found))))

(defun ontology-add-to-file (ontology category)
  "Добавляет онтологию в указанную категорию в файле"
  (with-temp-buffer
    ;; Если файл существует, загружаем его содержимое
    (when (file-exists-p ontology-file)
      (insert-file-contents ontology-file))

    ;; Если файл пустой или не существует, создаем базовую структуру
    (when (= (point-min) (point-max))
      (insert "* Parent\n* Friend\n* Child\n* None\n* Unassigned\n"))

    ;; Ищем нужную категорию
    (goto-char (point-min))
    (if (re-search-forward (format "^\\* %s$" category) nil t)
        (progn
          ;; Находим конец секции (следующий заголовок или конец файла)
          (let ((section-start (point))
                (section-end (if (re-search-forward "^\\*" nil t)
                                 (progn (beginning-of-line) (point))
                               (point-max))))
            ;; Переходим к концу секции
            (goto-char section-end)
            ;; Если мы не в конце файла, вставляем перед следующим заголовком
            (when (< (point) (point-max))
              (backward-char))
            ;; Вставляем новую онтологию
            (unless (bolp) (insert "\n"))
            (insert (format "- %s\n" ontology))))

      ;; Если категория не найдена, добавляем её в конец
      (goto-char (point-max))
      (unless (bolp) (insert "\n"))
      (insert (format "* %s\n- %s\n" category ontology)))

    ;; Сохраняем файл
    (write-file ontology-file)))

(defun ontology-get-at-point ()
  "Возвращает название онтологии под курсором или nil"
  (save-excursion
    (beginning-of-line)
    (when (re-search-forward ontology-pattern (line-end-position) t)
      (substring (match-string 1) 1 -1))))

(defun ontology-list-all ()
  "Возвращает список всех онтологий из файла"
  (let ((ontologies nil))
    (when (file-exists-p ontology-file)
      (with-temp-buffer
        (insert-file-contents ontology-file)
        (goto-char (point-min))
        (while (re-search-forward "^-\\s-*\\(.+\\)$" nil t)
          (push (match-string 1) ontologies))))
    (reverse ontologies)))

;; Дополнительная функция для быстрого просмотра онтологий
(defun ontology-show-all ()
  "Показывает все существующие онтологии"
  (interactive)
  (let ((ontologies (ontology-list-all)))
    (if ontologies
        (message "Существующие онтологии: %s" (mapconcat 'identity ontologies ", "))
      (message "Файл онтологий пуст или не существует"))))
#+end_src

#+begin_src emacs-lisp :tangle no
(defvar ontology-hash (make-hash-table :test 'equal)
  "Хеш-таблица, где ключи — категории (Parent, Child, ...), а значения — список терминов.")

(defun ontology-load-hash ()
  "Загружает онтологию из org-файла и обновляет `ontology-hash`."
  (interactive)
  (with-temp-buffer
    (insert-file-contents ontology-file)
    (let ((current-category nil))
      (clrhash ontology-hash)
      (while (re-search-forward "^\\(*+\\) \\(.*\\)$\\|^- \\(.*\\)$" nil t)
        (cond
         ;; Заголовок категории
         ((match-string 2)
          (setq current-category (match-string 2))
          (puthash current-category '() ontology-hash))
         ;; Подэлемент категории
         ((match-string 3)
          (let ((term (match-string 3)))
            (puthash current-category
                     (append (gethash current-category ontology-hash) (list term))
                     ontology-hash))))))))

(defun ontology-get-candidates (prefix)
  "Возвращает список терминов онтологии по префиксу."
  (ontology-load-hash)
  (pcase prefix
    ("__p" (gethash "Parent" ontology-hash))
    ("__c" (gethash "Child" ontology-hash))
    ("__f" (gethash "Friend" ontology-hash))
    ("__n" (gethash "None" ontology-hash))
    ("__u" (gethash "Unassigned" ontology-hash))
    ("__:" (apply #'append
                  (hash-table-values ontology-hash)))
    (_ nil)))

(defun ontology-company-backend (command &optional arg &rest ignored)
  "Backend для company-mode, предлагающий онтологии."
  (interactive (list 'interactive))
  (cl-case command
    (interactive (company-begin-backend 'ontology-company-backend))
    (prefix (when (looking-back "__\\(?:p\\|c\\|f\\|n\\|u\\|:\\)\\([[:word:]]*\\)" (line-beginning-position))
              (match-string 0)))
    (candidates (ontology-get-candidates arg))
    (post-completion
     (delete-region (- (point) (length arg)) (point))
     (insert (format "_%s_: [[%s][%s]]"
                     arg
                     (read-string "URL: ")
                     (read-string "Описание: "))))))

;; (defun ontology-org-mode-company-setup ()
;;   "Настройка company-backends для org-mode."
;;   (add-to-list 'company-backends 'ontology-company-backend))

;; (add-to-list 'company-backends 'ontology-company-backend)
;; (add-hook 'org-mode-hook #'company-mode)
;; (add-hook 'org-mode-hook #'ontology-load-hash)
;; (add-hook 'org-mode-hook #'ontology-org-mode-company-setup)
#+end_src

**** TODO Progress
- [X] ~find-ontology (link)~
  - [X] ~find-ontology-category (ontology)~
- [ ] list all ontologies
- [-] Manager
  - [X] Show lists of assigned ontologies (file)
  - [ ] List unassigned ontologies (find)
  - [X] ~ontology-assign (point)~ : p, f, c, n
- [ ] Autosuggest (based on file)
  - ~__:~ - all ontologies
  - ~__p~ - parents
  - ~__c~ - childs
  - ~__f~ - friends
  - ~___~ - none

** CANCELLED Org-brain
CLOSED: [2025-05-22 Чт 19:57]
#+begin_src emacs-lisp :tangle no
(after! org
  (setq org-brain-path org-directory))
#+end_src
** TODO Journal
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq +org-capture-journal-file (expand-file-name "Дневник" org-directory)))
#+end_src
** TODO Contacts
#+begin_src emacs-lisp :tangle yes
(after! org
  (defvar org-contacts-directory (expand-file-name "Контакты/" org-directory) "Directory with Org Contacts files")
  (setq org-contacts-files (directory-files-recursively org-contacts-directory "\.org$")))
#+end_src
** TODO Input Method
#+begin_src emacs-lisp :tangle no
(defun my/org-set-input-method-from-language ()
  "Set input method in org-mode according to #+LANGUAGE value."
  (when (derived-mode-p 'org-mode)
    (save-excursion
      (goto-char (point-min))
      (when (re-search-forward "^#\\+language: +\\(\\w+\\)" nil t)
        (let* ((lang (match-string 1))
               (input-method
                (pcase (downcase lang)
                  ("russian" "russian-computer")
                  ("english" nil)
                  ;; Добавь другие языки при необходимости
                  )))
          (when input-method
            (set-input-method input-method)))))))

(add-hook 'org-mode-hook #'my/org-set-input-method-from-language)

#+end_src
** TODO LaTeX
#+begin_src emacs-lisp :tangle no
(setq org-startup-with-latex-preview nil)
#+end_src
* Babel
#+begin_src emacs-lisp :tangle yes
(after! ob-plantuml
  (setq plantuml-jar-path nil)
  (setq org-plantuml-jar-path plantuml-jar-path)
  (setq plantuml-exec-mode 'executable)
  (setq org-plantuml-exec-mode plantuml-exec-mode))

#+end_src
