config.el

;; Переменные конфигурации
(defvar ontology-file (expand-file-name "ontology.org" (getenv "DOOMDIR"))
  "Путь к файлу онтологий")

(defvar ontology-pattern "\\(_[^_]+_\\):\\s-*\\[\\[\\([^]]+\\)\\]\\[\\([^]]+\\)\\]\\]"
  "Регулярное выражение для поиска конструкций онтологии")

(defun ontology-extract-and-save ()
  "Извлекает онтологию из конструкции под курсором и сохраняет в ontology.org"
  (interactive)
  (let ((ontology-name (ontology-get-at-point)))

    (unless ontology-name
      (error "Курсор не находится на конструкции онтологии"))

    ;; Проверяем, существует ли уже такая онтология
    (let ((existing-category (ontology-get-category ontology-name)))
      (if existing-category
          (message "Онтология '%s' уже существует в категории '%s'" ontology-name existing-category)

        ;; Предлагаем выбрать категорию
        (let ((category (completing-read
                         (format "Выберите категорию для '%s': " ontology-name)
                         '("Parent" "Child" "Friend" "None" "Unassigned")
                         nil t)))

          ;; Добавляем онтологию в файл
          (ontology-add-to-file ontology-name category)
          (message "Онтология '%s' добавлена в категорию '%s'" ontology-name category))))))

(defun ontology-get-category (ontology-name)
  "Возвращает категорию онтологии или nil, если онтология не найдена"
  (when (file-exists-p ontology-file)
    (with-temp-buffer
      (insert-file-contents ontology-file)
      (goto-char (point-min))
      (let ((current-category nil)
            (found nil))
        (while (and (not (eobp)) (not found))
          (let ((line (string-trim (thing-at-point 'line t))))
            (cond
             ;; Заголовок категории
             ((string-match "^\\* \\(.+\\)$" line)
              (setq current-category (match-string 1 line)))
             ;; Элемент списка
             ((string-match "^-\\s-*\\(.+\\)$" line)
              (when (string= (match-string 1 line) ontology-name)
                (setq found current-category)))))
          (forward-line 1))
        found))))

(defun ontology-add-to-file (ontology category)
  "Добавляет онтологию в указанную категорию в файле"
  (with-temp-buffer
    ;; Если файл существует, загружаем его содержимое
    (when (file-exists-p ontology-file)
      (insert-file-contents ontology-file))

    ;; Если файл пустой или не существует, создаем базовую структуру
    (when (= (point-min) (point-max))
      (insert "* Parent\n* Friend\n* Child\n* None\n* Unassigned\n"))

    ;; Ищем нужную категорию
    (goto-char (point-min))
    (if (re-search-forward (format "^\\* %s$" category) nil t)
        (progn
          ;; Находим конец секции (следующий заголовок или конец файла)
          (let ((section-start (point))
                (section-end (if (re-search-forward "^\\*" nil t)
                                 (progn (beginning-of-line) (point))
                               (point-max))))
            ;; Переходим к концу секции
            (goto-char section-end)
            ;; Если мы не в конце файла, вставляем перед следующим заголовком
            (when (< (point) (point-max))
              (backward-char))
            ;; Вставляем новую онтологию
            (unless (bolp) (insert "\n"))
            (insert (format "- %s\n" ontology))))

      ;; Если категория не найдена, добавляем её в конец
      (goto-char (point-max))
      (unless (bolp) (insert "\n"))
      (insert (format "* %s\n- %s\n" category ontology)))

    ;; Сохраняем файл
    (write-file ontology-file)))

(defun ontology-get-at-point ()
  "Возвращает название онтологии под курсором или nil"
  (save-excursion
    (beginning-of-line)
    (when (re-search-forward ontology-pattern (line-end-position) t)
      (substring (match-string 1) 1 -1))))

(defun ontology-list-all ()
  "Возвращает список всех онтологий из файла"
  (let ((ontologies nil))
    (when (file-exists-p ontology-file)
      (with-temp-buffer
        (insert-file-contents ontology-file)
        (goto-char (point-min))
        (while (re-search-forward "^-\\s-*\\(.+\\)$" nil t)
          (push (match-string 1) ontologies))))
    (reverse ontologies)))

;; Дополнительная функция для быстрого просмотра онтологий
(defun ontology-show-all ()
  "Показывает все существующие онтологии"
  (interactive)
  (let ((ontologies (ontology-list-all)))
    (if ontologies
        (message "Существующие онтологии: %s" (mapconcat 'identity ontologies ", "))
      (message "Файл онтологий пуст или не существует"))))

(after! org
  (setq +org-capture-journal-file (expand-file-name "Дневник" org-directory)))

(after! org
  (defvar org-contacts-directory (expand-file-name "Контакты/" org-directory) "Directory with Org Contacts files")
  (setq org-contacts-files (directory-files-recursively org-contacts-directory "\.org$")))

(setq +latex-viewers '(zathura))
(setq org-startup-with-latex-preview nil)
(after! org
  ;; увеличить масштаб latex-превью
  (plist-put org-format-latex-options :scale 2.0))

(after! ob-plantuml
  (setq plantuml-jar-path nil)
  (setq org-plantuml-jar-path plantuml-jar-path)
  (setq plantuml-exec-mode 'executable)
  (setq org-plantuml-exec-mode plantuml-exec-mode))
