config.org
* Auto-commit
Все изменения в Гримуаре автоматически коммитятся каждые 15 минут. Чтобы иметь возможность остановить этот процесс, например, для манипуляций с ветками или изменения конвенций, я добавляю следующие функции
#+begin_src emacs-lisp :tangle yes
(defvar my/autocommit-timer "auto-commit-grimuar.timer" "Название auto-commit таймера")

(defun my/start-autocommit ()
  "Запустить таймер автокоммитов через systemd."
  (interactive)
  (let ((output (shell-command-to-string (format "systemctl --user start %s && echo 'Autocommit timer started'" my/autocommit-timer))))
    (message "%s" (string-trim output))))

(defun my/stop-autocommit ()
  "Остановить таймер автокоммитов через systemd."
  (interactive)
  (let ((output (shell-command-to-string (format "systemctl --user stop %s && echo 'Autocommit timer stopped'" my/autocommit-timer))))
    (message "%s" (string-trim output))))

(defun my/toggle-autocommit ()
  "Переключить таймер автокоммитов через systemd."
  (interactive)
  (let ((exit-code (call-process-shell-command
                    (format "systemctl --user is-active --quiet %s" my/autocommit-timer))))
    (if (eq exit-code 0)
        (my/stop-autocommit)
      (my/start-autocommit))))
#+end_src

Однократно запустить
#+begin_src emacs-lisp :tangle yes
(defvar my/autocommit-service "auto-commit-grimuar.service"
  "Имя systemd сервиса, запускающего скрипт один раз.")

(defun my/run-autocommit-once ()
  "Однократно выполнить автокоммит через systemd service."
  (interactive)
  (let ((output (shell-command-to-string (format "systemctl --user start %s && echo 'Гримуар auto-commit done'" my/autocommit-service))))
    (message "%s" (string-trim output))))
#+end_src

Биндинги
#+begin_src emacs-lisp :tangle yes
(map! :leader
      (:prefix "n" ;; notes menu
               (:prefix ("g" . "git")
                :desc "Enable autosave"        "e" #'my/start-autocommit
                :desc "Disable autosave"       "d" #'my/stop-autocommit
                :desc "Toggle autosatve"       "t" #'my/toggle-autocommit
                :desc "Save"                   "s" #'my/run-autocommit-once)))

(map! :leader
      (:prefix "t"  ;; toggle menu
       :desc "Toggle notes autosave"  "n" #'my/toggle-autocommit))

#+end_src
* Dired
** Keybindings Within Dired With Peep-Dired-Mode Enabled
If peep-dired is enabled, you will get image previews as you go up/down with 'j' and 'k'

| COMMAND              | DESCRIPTION                                | KEYBINDING |
|----------------------+--------------------------------------------+------------|
| peep-dired           | /Toggle previews within dired/             | SPC d p    |
| peep-dired-next-file | /Move to next file in peep-dired-mode/     | j          |
| peep-dired-prev-file | /Move to previous file in peep-dired-mode/ | k          |

#+begin_src emacs-lisp :tangle yes
(evil-define-key 'normal peep-dired-mode-map
  (kbd "j") 'peep-dired-next-file
  (kbd "k") 'peep-dired-prev-file
(add-hook 'peep-dired-hook 'evil-normalize-keymaps))

;; (after! dired
;;   (map! :map dired-mode-map
;;         :n "RET" #'dired-find-alternate-file
;;         :n "h" (lambda () (interactive) (find-alternate-file ".."))))

#+end_src
** Making deleted files go to trash can
#+begin_src emacs-lisp :tangle yes
(setq delete-by-moving-to-trash t)
#+end_src

=NOTE=: For convenience, you may want to create a symlink to 'local/share/Trash' in your home directory:
#+begin_example bash
cd ~/
ln -s ~/.local/share/Trash .
#+end_example
* Templates
** [[Capture templates][org-capture]]
** [[Org-roam-capture][org-roam-capture]]
** YASnippet
Шаблоны располагаются в =$DOOMDIR/snippets/{major-mode}/{snippet-name}=.
Шаблоны новых файлов называются =__=

[[elisp:(+default/browse-templates)][Список шаблонов по умолчанию]]
#+begin_src emacs-lisp :tangle no
(after! yasnippet
  (setq yas-snippet-dirs '("~/.dotfiles/.config/doom/snippets")))
#+end_src
** Org-tempo
Вставляет блоки (~begin~-~end~) через =org-insert-structure-template= ([[kbd:SPC C-c C-x s][C-c C-x s]])
* Projects
#+begin_src emacs-lisp :tangle yes
(setq projectile-project-search-path `("~/Documents/Code/" "~/source/" "~/.suckless/" "~/.config/"))
#+end_src
* Workspaces
#+begin_src emacs-lisp :tangle yes
(map! :leader
      (:prefix "TAB"
       :desc "Move workspace right"     [left]  #'+workspace/swap-left
       :desc "Move workspace left"      [right] #'+workspace/swap-right))
#+end_src
* Languages
** Python
#+begin_src emacs-lisp :tangle yes
(map! :map python-mode-map
      :localleader
      :desc "run REPL"                "s" #'run-python                ;; SPC m s — запустить REPL
      :desc "restart REPL"            "R" #'python-shell-restart      ;; SPC m r — перезапустить REPL
      :desc "run"                     "c" #'python-shell-send-buffer  ;; SPC m c — запустить весь скрипт
      :desc "run region"              "r" #'python-shell-send-region  ;; SPC m r — запустить выделенный код
      :desc "run function"            "j" #'python-shell-send-defun)  ;; SPC m j — отправить функцию в REPL
#+end_src
* Mail
#+begin_src emacs-lisp :tangle yes
;; (after! mu4e)
(setq mu4e-maildir "~/mail"
      mu4e-get-mail-command "mbsync mia-gmail"
      mu4e-update-interval 600
      mu4e-index-lazy-check t
      doom-modeline-mu4e t)

(set-email-account! "mia.kuon@gmail.com"
                    '((mu4e-sent-folder       . "/mia.kuon@gmail.com/Отправленные")
                      (mu4e-drafts-folder     . "/mia.kuon@gmail.com/Черновики")
                      (mu4e-trash-folder      . "/mia.kuon@gmail.com/Корзина")
                      (mu4e-refile-folder     . "/mia.kuon@gmail.com/Вся почта")
                      (user-mail-address      . "mia.kuon@gmail.com")
                      (mu4e-compose-signature . "---\nС уважением,\nКуон Миа Алексеевна")
                      (smtpmail-smtp-user     . "mia.kuon@gmail.com")
                      (smtpmail-smtp-server   . "smtp.gmail.com")
                      ;; (smtpmail-smtp-service  . 587)
                      ;; (smtpmail-stream-type   . starttls)
                      (smtpmail-servers-requiring-authorization . "smtp\\.gmail\\.com")
                      (send-mail-function . async-smtpmail-send-it)
                      (message-send-mail-function . async-smtpmail-send-it))
                    t)

(setq +mu4e-gmail-accounts
      '(("mia.kuon@gmail.com" . "/mia.kuon@gmail.com")))

(setq mu4e-bookmarks
      `((:name "Входящие"
         :query "maildir:/mia.kuon@gmail.com/INBOX"
         :key ?i
         :favorite t)

        (:name "Отмеченное"
         :query "flag:flagged"
         :key ?f)

        (:name "Черновики"
         :query "maildir:/mia.kuon@gmail.com/Черновики"
         :key ?d
         :hide-if-no-unread t)

        (:name "Важные"
         :query "maildir:/mia.kuon@gmail.com/Важное"
         :key ?I)

        (:name "Оповещения"
         :query "maildir:/mia.kuon@gmail.com/Оповещения"
         :key ?A)

        (:name "Отправленные"
         :query "maildir:/mia.kuon@gmail.com/Отправленные"
         :key ?s)

        (:name "Все письма"
         :query "maildir:/mia.kuon@gmail.com"
         :key ?a)

        (:name "Сегодня"
         :query "date:today..now"
         :key ?t)

        (:name "За последние 7 дней"
         :query "date:7d..now"
         :hide-unread t
         :key ?w)

        (:name "Непрочитанное"
         :query "flag:unread AND NOT flag:trashed"
         :key ?u
         :hide t)

        (:name "Корзина"
         :query "maildir:/mia.kuon@gmail.com/Корзина"
         :key ?b
         :hide t)

        (:name "Спам"
         :query "maildir:/mia.kuon@gmail.com/Спам"
         :key ?x
         :hide t)

        (:name "Аутентификация"
         :query "maildir:/mia.kuon@gmail.com/Аутентификация"
         :key ?!
         :hide t)

        (:name "Заказы"
         :query "maildir:/mia.kuon@gmail.com/Заказы"
         :key ?o
         :hide t)

        (:name "Чеки"
         :query "maildir:/mia.kuon@gmail.com/Чеки"
         :key ?B
         :hide t)

        (:name "Промоакции"
         :query "maildir:/mia.kuon@gmail.com/Промоакции"
         :key ?p
         :hide t)

        (:name "Соцсети"
         :query "maildir:/mia.kuon@gmail.com/Соцсети"
         :key ?S
         :hide t)))
#+end_src
